docs/scan_network_upnodes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-08 Thu 23:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>scan_network_upnodes</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">scan_network_upnodes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7954bbd">NAME</a></li>
<li><a href="#org88dfc09">SYNOPSIS</a></li>
<li><a href="#org4749c3b">DESCRIPTION</a>
<ul>
<li><a href="#orgb8a2d15">Optional Arguments:</a></li>
<li><a href="#org51e4dc9">Positional Arguments:</a></li>
</ul>
</li>
<li><a href="#org5b41d38">SEE ALSO</a></li>
</ul>
</div>
</div>


<div id="outline-container-org7954bbd" class="outline-2">
<h2 id="org7954bbd">NAME</h2>
<div class="outline-text-2" id="text-org7954bbd">
<p>
scan_network_upnodes - scan network for nodes that are <b>up</b>.
</p>
</div>
</div>

<div id="outline-container-org88dfc09" class="outline-2">
<h2 id="org88dfc09">SYNOPSIS</h2>
<div class="outline-text-2" id="text-org88dfc09">
<p>
scan_network_upnodes.sh -h
</p>

<p>
scan_network_upnodes.sh &#x2013;help
</p>

<p>
scan_network_upnodes.sh [options] IPRANGE STARTIP STOPIP
</p>
</div>
</div>

<div id="outline-container-org4749c3b" class="outline-2">
<h2 id="org4749c3b">DESCRIPTION</h2>
<div class="outline-text-2" id="text-org4749c3b">
<p>
ping IP in 192.168.IPRANGE.* and report responding nodes
</p>
</div>

<div id="outline-container-orgb8a2d15" class="outline-3">
<h3 id="orgb8a2d15">Optional Arguments:</h3>
<div class="outline-text-3" id="text-orgb8a2d15">
<p>
-h                  Print usage and exit
</p>

<p>
&#x2013;help              Print this help message and exit
</p>

<p>
-d|&#x2013;down           Print 'down' IPs as !down!
</p>

<p>
-p PORT|&#x2013;port PORT Scan these ports (passed to <code>nmap</code>)
</p>
</div>
</div>

<div id="outline-container-org51e4dc9" class="outline-3">
<h3 id="org51e4dc9">Positional Arguments:</h3>
<div class="outline-text-3" id="text-org51e4dc9">
<p>
IPRANGE     penultimate 8 bits [default=0]
</p>

<p>
STARTIP     starting node to scan [default=2]
</p>

<p>
STOPIP      last node to scan [default=254]
</p>
</div>
</div>
</div>

<div id="outline-container-org5b41d38" class="outline-2">
<h2 id="org5b41d38">SEE ALSO</h2>
<div class="outline-text-2" id="text-org5b41d38">
<ul class="org-ul">
<li>nmap</li>
<li>ping</li>
</ul>
</div>
</div>
</div>
</body>
</html>
